%%
%20240426干电极控车TCP通信部分
%通过指令2，4，6，8控制小车动作
%小车前进后退耗时2s，转向动作耗时5秒
%========================================

%==========initial================
t=tcpip('192.168.1.30',6688,'NetworkRole','client');%与本地主机建立连接，端口号为30000，作为客户机连接
fopen(t);%与一个服务器建立连接，直到建立完成返回，否则报错。

%================command===================
order=[8,8,8,4,4,4,4,8,8,8,6,6,6,6,2,2,8,8];
for i=1:length(order)
    data=order(i);%发送的数字数据。
    data=num2str(data);
    pause(5);%等待连接稳定，随意设置。
    fwrite(t,data);%写入数字数据
end


%=======================close tcp==========================
fclose(t);




